tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1778_tdd.h
#define PMCON2                        522
#define VREGCON                       523
#define VREGPM                        524
#define RC1REG                        525
#define TX1REG                        526
#define SP1BRGL                       527
#define SP1BRGH                       528
#define RC1STA                        529
#define RX9D                          530
#define OERR                          531
#define FERR                          532
#define ADDEN                         533
#define CREN                          534
#define SREN                          535
#define RX9                           536
#define SPEN                          537
#define TX1STA                        538
#define TX9D                          539
#define TRMT                          540
#define BRGH                          541
#define SENDB                         542
#define TX1STA_SYNC                   543
#define TXEN                          544
#define TX9                           545
#define CSRC                          546
#define BAUD1CON                      547
#define ABDEN                         548
#define WUE                           549
#define BRG16                         550
#define SCKP                          551
#define RCIDL                         552
#define ABDOVF                        553
#define WPUA                          554
#define WPUA0                         555
#define WPUA1                         556
#define WPUA2                         557
#define WPUA3                         558
#define WPUA4                         559
#define WPUA5                         560
#define WPUA6                         561
#define WPUA7                         562
#define WPUB                          563
#define WPUB0                         564
#define WPUB1                         565
#define WPUB2                         566
#define WPUB3                         567
#define WPUB4                         568
#define WPUB5                         569
#define WPUB6                         570
#define WPUB7                         571
#define WPUC                          572
#define WPUC0                         573
#define WPUC1                         574
#define WPUC2                         575
#define WPUC3                         576
#define WPUC4                         577
#define WPUC5                         578
#define WPUC6                         579
#define WPUC7                         580
#define WPUE                          581
#define WPUE3                         582
#define SSP1BUF                       583
#define BUF                           584
#define BUF0                          585
#define SSP1BUF0                      586
#define BUF1                          587
#define SSP1BUF1                      588
#define BUF2                          589
#define SSP1BUF2                      590
#define BUF3                          591
#define SSP1BUF3                      592
#define BUF4                          593
#define SSP1BUF4                      594
#define BUF5                          595
#define SSP1BUF5                      596
#define BUF6                          597
#define SSP1BUF6                      598
#define BUF7                          599
#define SSP1BUF7                      600
#define ADD0                          601
#define ADD                           602
#define SSP1ADD0                      603
#define SSP1ADD                       604
#define ADD1                          605
#define SSP1ADD1                      606
#define ADD2                          607
#define SSP1ADD2                      608
#define ADD3                          609
#define SSP1ADD3                      610
#define ADD4                          611
#define SSP1ADD4                      612
#define ADD5                          613
#define SSP1ADD5                      614
#define ADD6                          615
#define SSP1ADD6                      616
#define ADD7                          617
#define SSP1ADD7                      618
#define SSP1MSK0                      619
#define SSP1MSK                       620
#define MSK0                          621
#define MSK                           622
#define SSP1MSK1                      623
#define MSK1                          624
#define SSP1MSK2                      625
#define MSK2                          626
#define SSP1MSK3                      627
#define MSK3                          628
#define SSP1MSK4                      629
#define MSK4                          630
#define SSP1MSK5                      631
#define MSK5                          632
#define SSP1MSK6                      633
#define MSK6                          634
#define SSP1MSK7                      635
#define MSK7                          636
#define SSP1STAT                      637
#define BF                            638
#define UA                            639
#define R_nW                          640
#define S                             641
#define P                             642
#define D_nA                          643
#define CKE                           644
#define SMP                           645
#define SSP1CON1                      646
#define SSPM0                         647
#define SSPM                          648
#define SSPM1                         649
#define SSPM2                         650
#define SSPM3                         651
#define CKP                           652
#define SSPEN                         653
#define SSPOV                         654
#define WCOL                          655
#define SSP1CON2                      656
#define SEN                           657
#define RSEN                          658
#define PEN                           659
#define RCEN                          660
#define ACKEN                         661
#define ACKDT                         662
#define ACKSTAT                       663
#define GCEN                          664
#define SSP1CON3                      665
#define DHEN                          666
#define AHEN                          667
#define SBCDE                         668
#define SDAHT                         669
#define BOEN                          670
#define SCIE                          671
#define PCIE                          672
#define ACKTIM                        673
#define MD3CON0                       674
#define MD3BIT                        675
#define MD3CON0_BIT                   676
#define MD3CON0_OPOL                  677
#define MD3OPOL                       678
#define MD3CON0_OUT                   679
#define MD3OUT                        680
#define MD3EN                         681
#define MD3CON0_EN                    682
#define MD3CON1                       683
#define MD3CLSYNC                     684
#define MD3CON1_CLSYNC                685
#define MD3CLPOL                      686
#define MD3CON1_CLPOL                 687
#define MD3CON1_CHSYNC                688
#define MD3CHSYNC                     689
#define MD3CON1_CHPOL                 690
#define MD3CHPOL                      691
#define MD3SRC                        692
#define MD3SRC_MS                     693
#define MD3MS0                        694
#define MD3SRC_MS0                    695
#define MD3MS                         696
#define MD3SRC_MS1                    697
#define MD3MS1                        698
#define MD3SRC_MS2                    699
#define MD3MS2                        700
#define MD3SRC_MS3                    701
#define MD3MS3                        702
#define MD3SRC_MS4                    703
#define MD3MS4                        704
#define MD3CARL                       705
#define MD3CARL_CL0                   706
#define MD3CL                         707
#define MD3CARL_CL                    708
#define MD3CL0                        709
#define MD3CL1                        710
#define MD3CARL_CL1                   711
#define MD3CARL_CL2                   712
#define MD3CL2                        713
#define MD3CARL_CL3                   714
#define MD3CL3                        715
#define MD3CARL_CL4                   716
#define MD3CARH                       717
#define MD3CARH_CH                    718
#define MD3CARH_CH0                   719
#define MD3CH                         720
#define MD3CH0                        721
#define MD3CARH_CH1                   722
#define MD3CH1                        723
#define MD3CARH_CH2                   724
#define MD3CH2                        725
#define MD3CARH_CH3                   726
#define MD3CH3                        727
#define MD3CARH_CH4                   728
#define ODCONA                        729
#define ODA0                          730
#define ODA1                          731
#define ODA2                          732
#define ODA3                          733
#define ODA4                          734
#define ODA5                          735
#define ODA6                          736
#define ODA7                          737
#define ODCONB                        738
#define ODB0                          739
#define ODB1                          740
#define ODB2                          741
#define ODB3                          742
#define ODB4                          743
#define ODB5                          744
#define ODB6                          745
#define ODB7                          746
#define ODCONC                        747
#define ODC0                          748
#define ODC1                          749
#define ODC2                          750
#define ODC3                          751
#define ODC4                          752
#define ODC5                          753
#define ODC6                          754
#define ODC7                          755
#define CCPR1L                        756
#define CCPR1L_RL                     757
#define CCPR1H                        758
#define CCPR1H_RH                     759
#define CCP1CON                       760
#define CCP1CON_MODE                  761
#define CCP1MODE0                     762
#define CCP1CON_MODE0                 763
#define CCP1MODE                      764
#define CCP1MODE1                     765
#define CCP1CON_MODE1                 766
#define CCP1MODE2                     767
#define CCP1CON_MODE2                 768
#define CCP1MODE3                     769
#define CCP1CON_MODE3                 770
#define CCP1CON_FMT                   771
#define CCP1FMT                       772
#define CCP1CON_OUT                   773
#define CCP1OUT                       774
#define CCP1EN                        775
#define CCP1CON_EN                    776
#define CCP1CAP                       777
#define CCP1CTS0                      778
#define CCP1CAP_CTS                   779
#define CCP1CAP_CTS0                  780
#define CCP1CTS                       781
#define CCP1CTS1                      782
#define CCP1CAP_CTS1                  783
#define CCP1CTS2                      784
#define CCP1CAP_CTS2                  785
#define CCP1CTS3                      786
#define CCP1CAP_CTS3                  787
#define CCPR2L                        788
#define CCPR2L_RL                     789
#define CCPR2H                        790
#define CCPR2H_RH                     791
#define CCP2CON                       792
#define CCP2MODE                      793
#define CCP2MODE0                     794
#define CCP2CON_MODE0                 795
#define CCP2CON_MODE                  796
#define CCP2MODE1                     797
#define CCP2CON_MODE1                 798
#define CCP2MODE2                     799
#define CCP2CON_MODE2                 800
#define CCP2MODE3                     801
#define CCP2CON_MODE3                 802
#define CCP2FMT                       803
#define CCP2CON_FMT                   804
#define CCP2OUT                       805
#define CCP2CON_OUT                   806
#define CCP2EN                        807
#define CCP2CON_EN                    808
#define CCP2CAP                       809
#define CCP2CAP_CTS                   810
#define CCP2CAP_CTS0                  811
#define CCP2CTS                       812
#define CCP2CTS0                      813
#define CCP2CAP_CTS1                  814
#define CCP2CTS1                      815
#define CCP2CAP_CTS2                  816
#define CCP2CTS2                      817
#define CCP2CAP_CTS3                  818
#define CCP2CTS3                      819
#define CCPR7L                        820
#define CCPR7L_RL                     821
#define CCPR7H                        822
#define CCPR7H_RH                     823
#define CCP7CON                       824
#define CCP7CON_MODE0                 825
#define CCP7CON_MODE                  826
#define CCP7MODE0                     827
#define CCP7MODE                      828
#define CCP7CON_MODE1                 829
#define CCP7MODE1                     830
#define CCP7CON_MODE2                 831
#define CCP7MODE2                     832
#define CCP7CON_MODE3                 833
#define CCP7MODE3                     834
#define CCP7CON_FMT                   835
#define CCP7FMT                       836
#define CCP7CON_OUT                   837
#define CCP7OUT                       838
#define CCP7EN                        839
#define CCP7CON_EN                    840
#define CCP7CAP                       841
#define CCP7CTS                       842
#define CCP7CAP_CTS0                  843
#define CCP7CAP_CTS                   844
#define CCP7CTS0                      845
#define CCP7CTS1                      846
#define CCP7CAP_CTS1                  847
#define CCP7CTS2                      848
#define CCP7CAP_CTS2                  849
#define CCP7CAP_CTS3                  850
#define CCP7CTS3                      851
#define CCPTMRS1                      852
#define C1TSEL0                       853
#define C1TSEL                        854
#define C1TSEL1                       855
#define C2TSEL0                       856
#define C2TSEL                        857
#define C2TSEL1                       858
#define C7TSEL                        859
#define C7TSEL0                       860
#define C7TSEL1                       861
#define CCPTMRS2                      862
#define P3TSEL                        863
#define P3TSEL0                       864
#define P3TSEL1                       865
#define P4TSEL0                       866
#define P4TSEL                        867
#define P4TSEL1                       868
#define P9TSEL0                       869
#define P9TSEL                        870
#define P9TSEL1                       871
#define SLRCONA                       872
#define SLRA0                         873
#define SLRA1                         874
#define SLRA2                         875
#define SLRA3                         876
#define SLRA4                         877
#define SLRA5                         878
#define SLRA6                         879
#define SLRA7                         880
#define SLRCONB                       881
#define SLRB0                         882
#define SLRB1                         883
#define SLRB2                         884
#define SLRB3                         885
#define SLRB4                         886
#define SLRB5                         887
#define SLRB6                         888
#define SLRB7                         889
#define SLRCONC                       890
#define SLRC0                         891
#define SLRC1                         892
#define SLRC2                         893
#define SLRC3                         894
#define SLRC4                         895
#define SLRC5                         896
#define SLRC6                         897
#define SLRC7                         898
#define MD1CON0                       899
#define MD1BIT                        900
#define MD1CON0_BIT                   901
#define MD1OPOL                       902
#define MD1CON0_OPOL                  903
#define MD1CON0_OUT                   904
#define MD1OUT                        905
#define MD1CON0_EN                    906
#define MD1EN                         907
#define MD1CON1                       908
#define MD1CLSYNC                     909
#define MD1CON1_CLSYNC                910
#define MD1CON1_CLPOL                 911
#define MD1CLPOL                      912
#define MD1CON1_CHSYNC                913
#define MD1CHSYNC                     914
#define MD1CHPOL                      915
#define MD1CON1_CHPOL                 916
#define MD1SRC                        917
#define MD1MS0                        918
#define MD1SRC_MS0                    919
#define MD1MS                         920
#define MD1SRC_MS                     921
#define MD1MS1                        922
#define MD1SRC_MS1                    923
#define MD1MS2                        924
#define MD1SRC_MS2                    925
#define MD1MS3                        926
#define MD1SRC_MS3                    927
#define MD1MS4                        928
#define MD1SRC_MS4                    929
#define MD1CARL                       930
#define MD1CL                         931
#define MD1CARL_CL0                   932
#define MD1CL0                        933
#define MD1CARL_CL                    934
#define MD1CARL_CL1                   935
#define MD1CL1                        936
#define MD1CARL_CL2                   937
#define MD1CL2                        938
#define MD1CARL_CL3                   939
#define MD1CL3                        940
#define MD1CARL_CL4                   941
#define MD1CARH                       942
#define MD1CARH_CH                    943
#define MD1CH                         944
#define MD1CH0                        945
#define MD1CARH_CH0                   946
#define MD1CH1                        947
#define MD1CARH_CH1                   948
#define MD1CH2                        949
#define MD1CARH_CH2                   950
#define MD1CH3                        951
#define MD1CARH_CH3                   952
#define MD1CARH_CH4                   953
#define MD2CON0                       954
#define MD2BIT                        955
#define MD2CON0_BIT                   956
#define MD2CON0_OPOL                  957
#define MD2OPOL                       958
#define MD2CON0_OUT                   959
#define MD2OUT                        960
#define MD2CON0_EN                    961
#define MD2EN                         962
#define MD2CON1                       963
#define MD2CLSYNC                     964
#define MD2CON1_CLSYNC                965
#define MD2CON1_CLPOL                 966
#define MD2CLPOL                      967
#define MD2CON1_CHSYNC                968
#define MD2CHSYNC                     969
#define MD2CHPOL                      970
#define MD2CON1_CHPOL                 971
#define MD2SRC                        972
#define MD2MS                         973
#define MD2MS0                        974
#define MD2SRC_MS0                    975
#define MD2SRC_MS                     976
#define MD2SRC_MS1                    977
#define MD2MS1                        978
#define MD2MS2                        979
#define MD2SRC_MS2                    980
#define MD2MS3                        981
#define MD2SRC_MS3                    982
#define MD2MS4                        983
#define MD2SRC_MS4                    984
#define MD2CARL                       985
#define MD2CARL_CL                    986
#define MD2CL0                        987
#define MD2CARL_CL0                   988
#define MD2CL                         989
#define MD2CARL_CL1                   990
#define MD2CL1                        991
#define MD2CL2                        992
#define MD2CARL_CL2                   993
#define MD2CL3                        994
#define MD2CARL_CL3                   995
#define MD2CARL_CL4                   996
#define MD2CARH                       997
#define MD2CARH_CH0                   998
#define MD2CH0                        999
#define MD2CARH_CH                    1000
#define MD2CH                         1001
#define MD2CARH_CH1                   1002
#define MD2CH1                        1003
#define MD2CARH_CH2                   1004
#define MD2CH2                        1005
#define MD2CARH_CH3                   1006
#define MD2CH3                        1007
#define MD2CARH_CH4                   1008
#define INLVLA                        1009
#define INLVLA0                       1010
#define INLVLA1                       1011
#define INLVLA2                       1012
#define INLVLA3                       1013
#define INLVLA4                       1014
#define INLVLA5                       1015
#define INLVA6                        1016
#define INLVA7                        1017
#define INLVLB                        1018
#define INLVB0                        1019
#define INLVB1                        1020
#define INLVB2                        1021
#define INLVB3                        1022
#define INLVLB4                       1023
#define INLVLB5                       1024
#define INLVLB6                       1025
#define INLVLB7                       1026
#define INLVLC                        1027
#define INLVLC0                       1028
#define INLVLC1                       1029
#define INLVLC2                       1030
#define INLVLC3                       1031
#define INLVLC4                       1032
#define INLVLC5                       1033
#define INLVLC6                       1034
#define INLVLC7                       1035
#define INLVE                         1036
#define INLVE3                        1037
#define IOCAP                         1038
#define IOCAP0                        1039
#define IOCAP1                        1040
#define IOCAP2                        1041
#define IOCAP3                        1042
#define IOCAP4                        1043
#define IOCAP5                        1044
#define IOCAP6                        1045
#define IOCAP7                        1046
#define IOCAN                         1047
#define IOCAN0                        1048
#define IOCAN1                        1049
#define IOCAN2                        1050
#define IOCAN3                        1051
#define IOCAN4                        1052
#define IOCAN5                        1053
#define IOCAN6                        1054
#define IOCAN7                        1055
#define IOCAF                         1056
#define IOCAF0                        1057
#define IOCAF1                        1058
#define IOCAF2                        1059
#define IOCAF3                        1060
#define IOCAF4                        1061
#define IOCAF5                        1062
#define IOCAF6                        1063
#define IOCAF7                        1064
#define IOCBP                         1065
#define IOCBP0                        1066
#define IOCBP1                        1067
#define IOCBP2                        1068
#define IOCBP3                        1069
#define IOCBP4                        1070
#define IOCBP5                        1071
#define IOCBP6                        1072
#define IOCBP7                        1073
#define IOCBN                         1074
#define IOCBN0                        1075
#define IOCBN1                        1076
#define IOCBN2                        1077
#define IOCBN3                        1078
#define IOCBN4                        1079
#define IOCBN5                        1080
#define IOCBN6                        1081
#define IOCBN7                        1082
#define IOCBF                         1083
#define IOCBF0                        1084
#define IOCBF1                        1085
#define IOCBF2                        1086
#define IOCBF3                        1087
#define IOCBF4                        1088
#define IOCBF5                        1089
#define IOCBF6                        1090
