tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1778_tdd.h
#define IOCBF7                        1091
#define IOCCP                         1092
#define IOCCP0                        1093
#define IOCCP1                        1094
#define IOCCP2                        1095
#define IOCCP3                        1096
#define IOCCP4                        1097
#define IOCCP5                        1098
#define IOCCP6                        1099
#define IOCCP7                        1100
#define IOCCN                         1101
#define IOCCN0                        1102
#define IOCCN1                        1103
#define IOCCN2                        1104
#define IOCCN3                        1105
#define IOCCN4                        1106
#define IOCCN5                        1107
#define IOCCN6                        1108
#define IOCCN7                        1109
#define IOCCF                         1110
#define IOCCF0                        1111
#define IOCCF1                        1112
#define IOCCF2                        1113
#define IOCCF3                        1114
#define IOCCF4                        1115
#define IOCCF5                        1116
#define IOCCF6                        1117
#define IOCCF7                        1118
#define IOCEP                         1119
#define IOCEP3                        1120
#define IOCEN                         1121
#define IOCEN3                        1122
#define IOCEF                         1123
#define IOCEF3                        1124
#define HIDRVB                        1125
#define HIDB0                         1126
#define HIDB1                         1127
#define TMR5L                         1128
#define TMR5L_TMR                     1129
#define TMR5H                         1130
#define TMR5H_TMR                     1131
#define T5CON                         1132
#define TMR5ON                        1133
#define T5CON_ON                      1134
#define T5ON                          1135
#define T5CON_TMRON                   1136
#define T5CON_SYNC                    1137
#define T5CON_nSYNC                   1138
#define nT5SYNC                       1139
#define T5CON_SOSCEN                  1140
#define T5OSCEN                       1141
#define T5CON_OSCEN                   1142
#define T5CON_CKPS                    1143
#define T5CON_CKPS0                   1144
#define T5CKPS0                       1145
#define T5CON_CKPS1                   1146
#define T5CKPS1                       1147
#define T5CON_CS0                     1148
#define T5CON_CS                      1149
#define T5CS0                         1150
#define TMR5CS0                       1151
#define T5CON_CS1                     1152
#define T5CS1                         1153
#define TMR5CS1                       1154
#define T5GCON                        1155
#define T5GSS0                        1156
#define T5GCON_GSS0                   1157
#define T5GCON_GSS                    1158
#define T5GSS1                        1159
#define T5GCON_GSS1                   1160
#define T5GVAL                        1161
#define T5GCON_GVAL                   1162
#define T5GCON_GGO_nDONE              1163
#define T5GGO_nDONE                   1164
#define T5GSPM                        1165
#define T5GCON_GSPM                   1166
#define T5GTM                         1167
#define T5GCON_GTM                    1168
#define T5GPOL                        1169
#define T5GCON_GPOL                   1170
#define T5GE                          1171
#define TMR5GE                        1172
#define T5GCON_GE                     1173
#define T4TMR                         1174
#define TMR4                          1175
#define T4TMR_TMR                     1176
#define T4PR_PR                       1177
#define T4PR                          1178
#define T4CON                         1179
#define T4CON_OUTPS                   1180
#define T4OUTPS0                      1181
#define T4OUTPS                       1182
#define T4CON_OUTPS0                  1183
#define T4OUTPS1                      1184
#define T4CON_OUTPS1                  1185
#define T4CON_OUTPS2                  1186
#define T4OUTPS2                      1187
#define T4OUTPS3                      1188
#define T4CON_OUTPS3                  1189
#define T4CKPS0                       1190
#define T4CON_CKPS0                   1191
#define T4CKPS                        1192
#define T4CON_CKPS                    1193
#define T4CKPS1                       1194
#define T4CON_CKPS1                   1195
#define T4CKPS2                       1196
#define T4CON_CKPS2                   1197
#define T4CON_ON                      1198
#define T4ON                          1199
#define TMR4ON                        1200
#define T4HLT                         1201
#define T4MODE                        1202
#define T4HLT_MODE                    1203
#define T4HLT_MODE0                   1204
#define T4MODE0                       1205
#define T4HLT_MODE1                   1206
#define T4MODE1                       1207
#define T4HLT_MODE2                   1208
#define T4MODE2                       1209
#define T4HLT_MODE3                   1210
#define T4MODE3                       1211
#define T4HLT_MODE4                   1212
#define T4MODE4                       1213
#define T4HLT_CKSYNC                  1214
#define T4CKSYNC                      1215
#define T4HLT_CKPOL                   1216
#define T4CKPOL                       1217
#define T4HLT_PSYNC                   1218
#define T4PSYNC                       1219
#define T4CLKCON                      1220
#define T4CS                          1221
#define T4CLKCON_CS                   1222
#define T4CS0                         1223
#define T4CLKCON_CS0                  1224
#define T4CS1                         1225
#define T4CLKCON_CS1                  1226
#define T4CS2                         1227
#define T4CLKCON_CS2                  1228
#define T4CS3                         1229
#define T4CLKCON_CS3                  1230
#define T4RST                         1231
#define T4RST_RSEL                    1232
#define T4RSEL0                       1233
#define T4RSEL                        1234
#define T4RST_RSEL0                   1235
#define T4RSEL1                       1236
#define T4RST_RSEL1                   1237
#define T4RSEL2                       1238
#define T4RST_RSEL2                   1239
#define T4RSEL3                       1240
#define T4RST_RSEL3                   1241
#define T4RSEL4                       1242
#define T4RST_RSEL4                   1243
#define T6TMR                         1244
#define TMR6                          1245
#define T6TMR_TMR                     1246
#define T6PR_PR                       1247
#define T6PR                          1248
#define T6CON                         1249
#define T6CON_OUTPS0                  1250
#define T6OUTPS                       1251
#define T6CON_OUTPS                   1252
#define T6OUTPS0                      1253
#define T6CON_OUTPS1                  1254
#define T6OUTPS1                      1255
#define T6CON_OUTPS2                  1256
#define T6OUTPS2                      1257
#define T6CON_OUTPS3                  1258
#define T6OUTPS3                      1259
#define T6CON_CKPS0                   1260
#define T6CKPS                        1261
#define T6CKPS0                       1262
#define T6CON_CKPS                    1263
#define T6CON_CKPS1                   1264
#define T6CKPS1                       1265
#define T6CON_CKPS2                   1266
#define T6CKPS2                       1267
#define TMR6ON                        1268
#define T6ON                          1269
#define T6CON_ON                      1270
#define T6HLT                         1271
#define T6HLT_MODE0                   1272
#define T6HLT_MODE                    1273
#define T6MODE0                       1274
#define T6MODE                        1275
#define T6HLT_MODE1                   1276
#define T6MODE1                       1277
#define T6MODE2                       1278
#define T6HLT_MODE2                   1279
#define T6HLT_MODE3                   1280
#define T6MODE3                       1281
#define T6MODE4                       1282
#define T6HLT_MODE4                   1283
#define T6CKSYNC                      1284
#define T6HLT_CKSYNC                  1285
#define T6CKPOL                       1286
#define T6HLT_CKPOL                   1287
#define T6PSYNC                       1288
#define T6HLT_PSYNC                   1289
#define T6CLKCON                      1290
#define T6CS                          1291
#define T6CLKCON_CS                   1292
#define T6CLKCON_CS0                  1293
#define T6CS0                         1294
#define T6CLKCON_CS1                  1295
#define T6CS1                         1296
#define T6CLKCON_CS2                  1297
#define T6CS2                         1298
#define T6CLKCON_CS3                  1299
#define T6CS3                         1300
#define T6RST                         1301
#define T6RST_RSEL                    1302
#define T6RSEL                        1303
#define T6RSEL0                       1304
#define T6RST_RSEL0                   1305
#define T6RST_RSEL1                   1306
#define T6RSEL1                       1307
#define T6RSEL2                       1308
#define T6RST_RSEL2                   1309
#define T6RST_RSEL3                   1310
#define T6RSEL3                       1311
#define T6RST_RSEL4                   1312
#define T6RSEL4                       1313
#define ADRESL                        1314
#define ADRESL_ADRES                  1315
#define ADRESH                        1316
#define ADRESH_ADRES                  1317
#define ADCON0                        1318
#define ADON                          1319
#define ADCON0_GO                     1320
#define CHS                           1321
#define ADCON1                        1322
#define ADPREF                        1323
#define ADNREF                        1324
#define ADCS                          1325
#define ADFM                          1326
#define ADCON2                        1327
#define TRIGSEL                       1328
#define T2TMR                         1329
#define TMR2                          1330
#define T2TMR_TMR                     1331
#define T2PR                          1332
#define T2PR_PR                       1333
#define T2CON                         1334
#define T2OUTPS0                      1335
#define T2CON_OUTPS0                  1336
#define T2OUTPS                       1337
#define T2CON_OUTPS                   1338
#define T2OUTPS1                      1339
#define T2CON_OUTPS1                  1340
#define T2OUTPS2                      1341
#define T2CON_OUTPS2                  1342
#define T2OUTPS3                      1343
#define T2CON_OUTPS3                  1344
#define T2CKPS0                       1345
#define T2CON_CKPS0                   1346
#define T2CON_CKPS                    1347
#define T2CKPS                        1348
#define T2CKPS1                       1349
#define T2CON_CKPS1                   1350
#define T2CKPS2                       1351
#define T2CON_CKPS2                   1352
#define T2CON_ON                      1353
#define TMR2ON                        1354
#define T2ON                          1355
#define T2HLT                         1356
#define T2HLT_MODE                    1357
#define T2MODE                        1358
#define T2MODE0                       1359
#define T2HLT_MODE0                   1360
#define T2MODE1                       1361
#define T2HLT_MODE1                   1362
#define T2MODE2                       1363
#define T2HLT_MODE2                   1364
#define T2MODE3                       1365
#define T2HLT_MODE3                   1366
#define T2MODE4                       1367
#define T2HLT_MODE4                   1368
#define T2HLT_CKSYNC                  1369
#define T2CKSYNC                      1370
#define T2HLT_CKPOL                   1371
#define T2CKPOL                       1372
#define T2PSYNC                       1373
#define T2HLT_PSYNC                   1374
#define T2CLKCON                      1375
#define T2CS                          1376
#define T2CS0                         1377
#define T2CLKCON_CS                   1378
#define T2CLKCON_CS0                  1379
#define T2CS1                         1380
#define T2CLKCON_CS1                  1381
#define T2CS2                         1382
#define T2CLKCON_CS2                  1383
#define T2CS3                         1384
#define T2CLKCON_CS3                  1385
#define T2RST                         1386
#define T2RSEL                        1387
#define T2RST_RSEL                    1388
#define T2RSEL0                       1389
#define T2RST_RSEL0                   1390
#define T2RSEL1                       1391
#define T2RST_RSEL1                   1392
#define T2RST_RSEL2                   1393
#define T2RSEL2                       1394
#define T2RSEL3                       1395
#define T2RST_RSEL3                   1396
#define T2RSEL4                       1397
#define T2RST_RSEL4                   1398
#define T8TMR                         1399
#define T8TMR_TMR                     1400
#define TMR8                          1401
#define T8PR_PR                       1402
#define T8PR                          1403
#define T8CON                         1404
#define T8OUTPS0                      1405
#define T8OUTPS                       1406
#define T8CON_OUTPS                   1407
#define T8CON_OUTPS0                  1408
#define T8OUTPS1                      1409
#define T8CON_OUTPS1                  1410
#define T8OUTPS2                      1411
#define T8CON_OUTPS2                  1412
#define T8OUTPS3                      1413
#define T8CON_OUTPS3                  1414
#define T8CKPS                        1415
#define T8CON_CKPS0                   1416
#define T8CON_CKPS                    1417
#define T8CKPS0                       1418
#define T8CON_CKPS1                   1419
#define T8CKPS1                       1420
#define T8CON_CKPS2                   1421
#define T8CKPS2                       1422
#define T8ON                          1423
#define T8CON_ON                      1424
#define TMR8ON                        1425
#define T8HLT                         1426
#define T8HLT_MODE                    1427
#define T8MODE0                       1428
#define T8MODE                        1429
#define T8HLT_MODE0                   1430
#define T8MODE1                       1431
#define T8HLT_MODE1                   1432
#define T8MODE2                       1433
#define T8HLT_MODE2                   1434
#define T8MODE3                       1435
#define T8HLT_MODE3                   1436
#define T8MODE4                       1437
#define T8HLT_MODE4                   1438
#define T8CKSYNC                      1439
#define T8HLT_CKSYNC                  1440
#define T8HLT_CKPOL                   1441
#define T8CKPOL                       1442
#define T8HLT_PSYNC                   1443
#define T8PSYNC                       1444
#define T8CLKCON                      1445
#define T8CLKCON_CS0                  1446
#define T8CLKCON_CS                   1447
#define T8CS0                         1448
#define T8CS                          1449
#define T8CS1                         1450
#define T8CLKCON_CS1                  1451
#define T8CS2                         1452
#define T8CLKCON_CS2                  1453
#define T8CS3                         1454
#define T8CLKCON_CS3                  1455
#define T8RST                         1456
#define T8RST_RSEL0                   1457
#define T8RST_RSEL                    1458
#define T8RSEL                        1459
#define T8RSEL0                       1460
#define T8RST_RSEL1                   1461
#define T8RSEL1                       1462
#define T8RSEL2                       1463
#define T8RST_RSEL2                   1464
#define T8RSEL3                       1465
#define T8RST_RSEL3                   1466
#define T8RSEL4                       1467
#define T8RST_RSEL4                   1468
#define OPA1NCHS                      1469
#define OPA1NCH                       1470
#define OPA1NCHS_NCH                  1471
#define OPA1PCHS                      1472
#define OPA1PCHS_PCH                  1473
#define OPA1PCH                       1474
#define OPA1CON                       1475
#define OPA1CON_ORM                   1476
#define OPA1ORM0                      1477
#define OPA1CON_ORM0                  1478
#define OPA1ORM                       1479
#define OPA1ORM1                      1480
#define OPA1CON_ORM1                  1481
#define OPA1CON_ORPOL                 1482
#define OPA1ORPOL                     1483
#define OPA1CON_UG                    1484
#define OPA1UG                        1485
#define OPA1CON_EN                    1486
#define OPA1EN                        1487
#define OPA1ORS                       1488
#define OPA1ORS_ORS                   1489
#define OPA2NCHS                      1490
#define OPA2NCHS_NCH                  1491
#define OPA2NCH                       1492
#define OPA2PCHS                      1493
#define OPA2PCHS_PCH                  1494
#define OPA2PCH                       1495
#define OPA2CON                       1496
#define OPA2CON_ORM0                  1497
#define OPA2ORM                       1498
#define OPA2ORM0                      1499
#define OPA2CON_ORM                   1500
#define OPA2CON_ORM1                  1501
#define OPA2ORM1                      1502
#define OPA2CON_ORPOL                 1503
#define OPA2ORPOL                     1504
#define OPA2CON_UG                    1505
#define OPA2UG                        1506
#define OPA2CON_EN                    1507
#define OPA2EN                        1508
#define OPA2ORS                       1509
#define OPA2ORS_ORS                   1510
#define OPA3NCHS                      1511
#define OPA3NCH                       1512
#define OPA3NCHS_NCH                  1513
#define OPA3PCHS                      1514
#define OPA3PCH                       1515
#define OPA3PCHS_PCH                  1516
#define OPA3CON                       1517
#define OPA3CON_ORM                   1518
#define OPA3ORM0                      1519
#define OPA3ORM                       1520
#define OPA3CON_ORM0                  1521
#define OPA3ORM1                      1522
#define OPA3CON_ORM1                  1523
#define OPA3CON_ORPOL                 1524
#define OPA3ORPOL                     1525
#define OPA3CON_UG                    1526
#define OPA3UG                        1527
#define SP                            1528
#define OPA3SP                        1529
#define OPA3CON_EN                    1530
#define OPA3EN                        1531
#define OPA3ORS                       1532
#define OPA3ORS_ORS                   1533
#define DACLD                         1534
#define DAC1LD                        1535
#define DAC2LD                        1536
#define DAC5LD                        1537
#define DAC1CON0                      1538
#define DAC1CON0_DACNSS0              1539
#define DAC1CON0_DACNSS               1540
#define DAC1CON0_NSS0                 1541
#define DAC1NSS                       1542
#define DAC1CON0_NSS                  1543
#define DAC1NSS0                      1544
#define DAC1CON0_NSS1                 1545
#define DAC1NSS1                      1546
#define DAC1CON0_DACNSS1              1547
#define DAC1CON0_DACPSS0              1548
#define DAC1CON0_PSS0                 1549
#define DAC1CON0_PSS                  1550
#define DAC1CON0_DACPSS               1551
#define DAC1PSS                       1552
#define DAC1PSS0                      1553
#define DAC1CON0_DACPSS1              1554
#define DAC1PSS1                      1555
#define DAC1CON0_PSS1                 1556
#define DAC1CON0_OE2                  1557
#define DAC1CON0_DACOE2               1558
#define DAC1OE2                       1559
#define DAC1CON0_OE1                  1560
#define DAC1CON0_DACOE                1561
#define DAC1CON0_OE                   1562
#define DAC1OE1                       1563
#define DAC1CON0_DACOE1               1564
#define DAC1CON0_FM                   1565
#define DAC1FM                        1566
#define DAC1CON0_DACFM                1567
#define DAC1CON0_EN                   1568
#define DAC1CON0_DACEN                1569
#define DAC1EN                        1570
#define DAC1REFL                      1571
#define DAC1REF0                      1572
#define DAC1REFL_R0                   1573
#define DAC1REFL_REF0                 1574
#define DAC1R0                        1575
#define DAC1REF1                      1576
#define DAC1REFL_REF1                 1577
#define DAC1REFL_R1                   1578
#define DAC1R1                        1579
#define DAC1REF2                      1580
#define DAC1REFL_R2                   1581
#define DAC1REFL_REF2                 1582
#define DAC1R2                        1583
#define DAC1REF3                      1584
#define DAC1REFL_R3                   1585
#define DAC1REFL_REF3                 1586
#define DAC1R3                        1587
#define DAC1REF4                      1588
#define DAC1REFL_REF4                 1589
#define DAC1REFL_R4                   1590
#define DAC1R4                        1591
#define DAC1REFL_R5                   1592
#define DAC1REF5                      1593
#define DAC1REFL_REF5                 1594
#define DAC1R5                        1595
#define DAC1REF6                      1596
#define DAC1REFL_REF6                 1597
#define DAC1REFL_R6                   1598
#define DAC1R6                        1599
#define DAC1REF7                      1600
#define DAC1REFL_REF7                 1601
#define DAC1REFL_R7                   1602
#define DAC1R7                        1603
#define DAC1REFH                      1604
#define DAC1REFH_R8                   1605
#define DAC1REF8                      1606
#define DAC1REFH_REF8                 1607
#define DAC1R8                        1608
#define DAC1REF9                      1609
#define DAC1REFH_R9                   1610
#define DAC1REFH_REF9                 1611
#define DAC1R9                        1612
#define DAC1REFH_REF10                1613
#define DAC1R10                       1614
#define DAC1REF10                     1615
#define DAC1REFH_R10                  1616
#define DAC1REFH_REF11                1617
#define DAC1R11                       1618
#define DAC1REF11                     1619
#define DAC1REFH_R11                  1620
#define DAC1REFH_REF12                1621
#define DAC1REF12                     1622
#define DAC1R12                       1623
#define DAC1REFH_R12                  1624
#define DAC1REFH_REF13                1625
#define DAC1R13                       1626
#define DAC1REF13                     1627
#define DAC1REFH_R13                  1628
#define DAC1REFH_REF14                1629
#define DAC1R14                       1630
#define DAC1REF14                     1631
#define DAC1REFH_R14                  1632
#define DAC1REFH_REF15                1633
#define DAC1R15                       1634
#define DAC1REF15                     1635
#define DAC1REFH_R15                  1636
#define DAC2CON0                      1637
#define DAC2CON0_DACNSS               1638
#define DAC2CON0_NSS0                 1639
#define DAC2NSS                       1640
#define DAC2NSS0                      1641
#define DAC2CON0_NSS                  1642
#define DAC2CON0_DACNSS0              1643
#define DAC2CON0_NSS1                 1644
#define DAC2NSS1                      1645
#define DAC2CON0_DACNSS1              1646
#define DAC2CON0_DACPSS0              1647
#define DAC2PSS0                      1648
