tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1778_tdd.h
#define DAC2PSS                       1649
#define DAC2CON0_DACPSS               1650
#define DAC2CON0_PSS0                 1651
#define DAC2CON0_PSS                  1652
#define DAC2CON0_DACPSS1              1653
#define DAC2PSS1                      1654
#define DAC2CON0_PSS1                 1655
#define DAC2CON0_DACOE2               1656
#define DAC2OE2                       1657
#define DAC2CON0_OE2                  1658
#define DAC2CON0_DACOE1               1659
#define DAC2CON0_OE1                  1660
#define DAC2CON0_DACOE                1661
#define DAC2OE1                       1662
#define DAC2CON0_OE                   1663
#define DAC2FM                        1664
#define DAC2CON0_DACFM                1665
#define DAC2CON0_FM                   1666
#define DAC2EN                        1667
#define DAC2CON0_DACEN                1668
#define DAC2CON0_EN                   1669
#define DAC2REFL                      1670
#define DAC2REF0                      1671
#define DAC2REFL_REF0                 1672
#define DAC2REFL_R0                   1673
#define DAC2R0                        1674
#define DAC2REF1                      1675
#define DAC2REFL_REF1                 1676
#define DAC2REFL_R1                   1677
#define DAC2R1                        1678
#define DAC2REF2                      1679
#define DAC2REFL_REF2                 1680
#define DAC2REFL_R2                   1681
#define DAC2R2                        1682
#define DAC2REF3                      1683
#define DAC2REFL_REF3                 1684
#define DAC2REFL_R3                   1685
#define DAC2R3                        1686
#define DAC2REF4                      1687
#define DAC2REFL_REF4                 1688
#define DAC2REFL_R4                   1689
#define DAC2R4                        1690
#define DAC2REF5                      1691
#define DAC2REFL_REF5                 1692
#define DAC2REFL_R5                   1693
#define DAC2R5                        1694
#define DAC2REF6                      1695
#define DAC2REFL_REF6                 1696
#define DAC2REFL_R6                   1697
#define DAC2R6                        1698
#define DAC2REF7                      1699
#define DAC2REFL_REF7                 1700
#define DAC2REFL_R7                   1701
#define DAC2R7                        1702
#define DAC2REFH                      1703
#define DAC2REF8                      1704
#define DAC2REFH_REF8                 1705
#define DAC2R8                        1706
#define DAC2REFH_R8                   1707
#define DAC2REF9                      1708
#define DAC2REFH_REF9                 1709
#define DAC2R9                        1710
#define DAC2REFH_R9                   1711
#define DAC2REFH_REF10                1712
#define DAC2REFH_R10                  1713
#define DAC2REF10                     1714
#define DAC2R10                       1715
#define DAC2REFH_R11                  1716
#define DAC2REFH_REF11                1717
#define DAC2REF11                     1718
#define DAC2R11                       1719
#define DAC2REFH_REF12                1720
#define DAC2REFH_R12                  1721
#define DAC2REF12                     1722
#define DAC2R12                       1723
#define DAC2REFH_R13                  1724
#define DAC2REF13                     1725
#define DAC2REFH_REF13                1726
#define DAC2R13                       1727
#define DAC2REFH_REF14                1728
#define DAC2REFH_R14                  1729
#define DAC2REF14                     1730
#define DAC2R14                       1731
#define DAC2REFH_REF15                1732
#define DAC2REFH_R15                  1733
#define DAC2R15                       1734
#define DAC2REF15                     1735
#define DAC3CON0                      1736
#define DAC3CON0_NSS                  1737
#define DAC3CON0_DACNSS               1738
#define DAC3NSS                       1739
#define DAC3CON0_NSS0                 1740
#define DAC3CON0_DACNSS0              1741
#define DAC3NSS0                      1742
#define DAC3CON0_NSS1                 1743
#define DAC3CON0_DACNSS1              1744
#define DAC3NSS1                      1745
#define DAC3CON0_PSS                  1746
#define DAC3PSS0                      1747
#define DAC3CON0_DACPSS               1748
#define DAC3PSS                       1749
#define DAC3CON0_DACPSS0              1750
#define DAC3CON0_PSS0                 1751
#define DAC3PSS1                      1752
#define DAC3CON0_DACPSS1              1753
#define DAC3CON0_PSS1                 1754
#define DAC3OE2                       1755
#define DAC3CON0_DACOE2               1756
#define DAC3CON0_OE2                  1757
#define DAC3OE1                       1758
#define DAC3CON0_DACOE1               1759
#define DAC3CON0_OE1                  1760
#define DAC3EN                        1761
#define DAC3CON0_EN                   1762
#define DAC3CON0_DACEN                1763
#define DAC3REF                       1764
#define DAC3REF0                      1765
#define DAC3R                         1766
#define DAC3REF_R0                    1767
#define DAC3REF_REF0                  1768
#define DAC3REF_DACR                  1769
#define DAC3R0                        1770
#define DAC3REF_DACR0                 1771
#define DAC3REF1                      1772
#define DAC3REF_R1                    1773
#define DAC3REF_REF1                  1774
#define DAC3R1                        1775
#define DAC3REF_DACR1                 1776
#define DAC3REF2                      1777
#define DAC3REF_R2                    1778
#define DAC3REF_REF2                  1779
#define DAC3R2                        1780
#define DAC3REF_DACR2                 1781
#define DAC3REF3                      1782
#define DAC3REF_REF3                  1783
#define DAC3REF_R3                    1784
#define DAC3R3                        1785
#define DAC3REF_DACR3                 1786
#define DAC3REF4                      1787
#define DAC3REF_REF4                  1788
#define DAC3REF_R4                    1789
#define DAC3R4                        1790
#define DAC3REF_DACR4                 1791
#define DAC4CON0                      1792
#define DAC4CON0_NSS0                 1793
#define DAC4NSS0                      1794
#define DAC4NSS                       1795
#define DAC4CON0_NSS                  1796
#define DAC4CON0_DACNSS0              1797
#define DAC4CON0_DACNSS               1798
#define DAC4CON0_NSS1                 1799
#define DAC4CON0_DACNSS1              1800
#define DAC4NSS1                      1801
#define DAC4PSS                       1802
#define DAC4CON0_DACPSS0              1803
#define DAC4CON0_PSS0                 1804
#define DAC4PSS0                      1805
#define DAC4CON0_DACPSS               1806
#define DAC4CON0_PSS                  1807
#define DAC4CON0_DACPSS1              1808
#define DAC4PSS1                      1809
#define DAC4CON0_PSS1                 1810
#define DAC4OE2                       1811
#define DAC4CON0_OE2                  1812
#define DAC4CON0_DACOE2               1813
#define DAC4CON0_OE1                  1814
#define DAC4CON0_DACOE1               1815
#define DAC4OE1                       1816
#define DAC4CON0_EN                   1817
#define DAC4CON0_DACEN                1818
#define DAC4EN                        1819
#define DAC4REF                       1820
#define DAC4REF_DACR0                 1821
#define DAC4REF_REF0                  1822
#define DAC4REF_DACR                  1823
#define DAC4R0                        1824
#define DAC4REF_R0                    1825
#define DAC4REF0                      1826
#define DAC4R                         1827
#define DAC4REF_DACR1                 1828
#define DAC4REF_REF1                  1829
#define DAC4R1                        1830
#define DAC4REF_R1                    1831
#define DAC4REF1                      1832
#define DAC4REF_DACR2                 1833
#define DAC4REF_REF2                  1834
#define DAC4REF2                      1835
#define DAC4R2                        1836
#define DAC4REF_R2                    1837
#define DAC4REF_DACR3                 1838
#define DAC4REF_REF3                  1839
#define DAC4R3                        1840
#define DAC4REF_R3                    1841
#define DAC4REF3                      1842
#define DAC4REF_DACR4                 1843
#define DAC4REF_R4                    1844
#define DAC4REF_REF4                  1845
#define DAC4R4                        1846
#define DAC4REF4                      1847
#define DAC5CON0                      1848
#define DAC5NSS                       1849
#define DAC5NSS0                      1850
#define DAC5CON0_DACNSS0              1851
#define DAC5CON0_NSS0                 1852
#define DAC5CON0_DACNSS               1853
#define DAC5CON0_NSS                  1854
#define DAC5CON0_DACNSS1              1855
#define DAC5CON0_NSS1                 1856
#define DAC5NSS1                      1857
#define DAC5CON0_DACPSS0              1858
#define DAC5CON0_PSS                  1859
#define DAC5CON0_PSS0                 1860
#define DAC5CON0_DACPSS               1861
#define DAC5PSS0                      1862
#define DAC5PSS                       1863
#define DAC5CON0_DACPSS1              1864
#define DAC5CON0_PSS1                 1865
#define DAC5PSS1                      1866
#define DAC5CON0_DACOE2               1867
#define DAC5OE2                       1868
#define DAC5CON0_OE2                  1869
#define DAC5CON0_DACOE1               1870
#define DAC5OE1                       1871
#define DAC5CON0_OE                   1872
#define DAC5CON0_OE1                  1873
#define DAC5CON0_DACOE                1874
#define DAC5FM                        1875
#define DAC5CON0_FM                   1876
#define DAC5CON0_DACFM                1877
#define DAC5CON0_EN                   1878
#define DAC5CON0_DACEN                1879
#define DAC5EN                        1880
#define DAC5REFL                      1881
#define DAC5REF0                      1882
#define DAC5REFL_REF0                 1883
#define DAC5REFL_R0                   1884
#define DAC5R0                        1885
#define DAC5REFL_R1                   1886
#define DAC5REF1                      1887
#define DAC5REFL_REF1                 1888
#define DAC5R1                        1889
#define DAC5REFL_REF2                 1890
#define DAC5REF2                      1891
#define DAC5REFL_R2                   1892
#define DAC5R2                        1893
#define DAC5REF3                      1894
#define DAC5REFL_REF3                 1895
#define DAC5REFL_R3                   1896
#define DAC5R3                        1897
#define DAC5REF4                      1898
#define DAC5R4                        1899
#define DAC5REFL_REF4                 1900
#define DAC5REFL_R4                   1901
#define DAC5REF5                      1902
#define DAC5R5                        1903
#define DAC5REFL_REF5                 1904
#define DAC5REFL_R5                   1905
#define DAC5REF6                      1906
#define DAC5REFL_REF6                 1907
#define DAC5R6                        1908
#define DAC5REFL_R6                   1909
#define DAC5REF7                      1910
#define DAC5REFL_REF7                 1911
#define DAC5R7                        1912
#define DAC5REFL_R7                   1913
#define DAC5REFH                      1914
#define DAC5REF8                      1915
#define DAC5REFH_REF8                 1916
#define DAC5R8                        1917
#define DAC5REFH_R8                   1918
#define DAC5R9                        1919
#define DAC5REFH_REF9                 1920
#define DAC5REFH_R9                   1921
#define DAC5REF9                      1922
#define DAC5R10                       1923
#define DAC5REFH_REF10                1924
#define DAC5REF10                     1925
#define DAC5REFH_R10                  1926
#define DAC5R11                       1927
#define DAC5REFH_REF11                1928
#define DAC5REF11                     1929
#define DAC5REFH_R11                  1930
#define DAC5R12                       1931
#define DAC5REFH_REF12                1932
#define DAC5REF12                     1933
#define DAC5REFH_R12                  1934
#define DAC5R13                       1935
#define DAC5REFH_REF13                1936
#define DAC5REF13                     1937
#define DAC5REFH_R13                  1938
#define DAC5R14                       1939
#define DAC5REFH_REF14                1940
#define DAC5REF14                     1941
#define DAC5REFH_R14                  1942
#define DAC5R15                       1943
#define DAC5REFH_REF15                1944
#define DAC5REF15                     1945
#define DAC5REFH_R15                  1946
#define DAC7CON0                      1947
#define DAC7CON0_NSS0                 1948
#define DAC7NSS                       1949
#define DAC7CON0_DACNSS0              1950
#define DAC7NSS0                      1951
#define DAC7CON0_DACNSS               1952
#define DAC7CON0_NSS                  1953
#define DAC7CON0_NSS1                 1954
#define DAC7CON0_DACNSS1              1955
#define DAC7NSS1                      1956
#define DAC7CON0_DACPSS0              1957
#define DAC7CON0_PSS0                 1958
#define DAC7CON0_DACPSS               1959
#define DAC7PSS0                      1960
#define DAC7PSS                       1961
#define DAC7CON0_PSS                  1962
#define DAC7CON0_DACPSS1              1963
#define DAC7CON0_PSS1                 1964
#define DAC7PSS1                      1965
#define DAC7CON0_DACOE2               1966
#define DAC7CON0_OE2                  1967
#define DAC7OE2                       1968
#define DAC7CON0_OE1                  1969
#define DAC7OE1                       1970
#define DAC7CON0_DACOE1               1971
#define DAC7CON0_EN                   1972
#define DAC7EN                        1973
#define DAC7CON0_DACEN                1974
#define DAC7REF                       1975
#define DAC7R                         1976
#define DAC7REF_R0                    1977
#define DAC7REF_REF0                  1978
#define DAC7REF0                      1979
#define DAC7REF_DACR0                 1980
#define DAC7REF_DACR                  1981
#define DAC7R0                        1982
#define DAC7REF_R1                    1983
#define DAC7REF_REF1                  1984
#define DAC7REF1                      1985
#define DAC7REF_DACR1                 1986
#define DAC7R1                        1987
#define DAC7REF_R2                    1988
#define DAC7REF2                      1989
#define DAC7REF_DACR2                 1990
#define DAC7REF_REF2                  1991
#define DAC7R2                        1992
#define DAC7REF_R3                    1993
#define DAC7REF_REF3                  1994
#define DAC7REF3                      1995
#define DAC7REF_DACR3                 1996
#define DAC7R3                        1997
#define DAC7REF_R4                    1998
#define DAC7REF4                      1999
#define DAC7REF_REF4                  2000
#define DAC7REF_DACR4                 2001
#define DAC7R4                        2002
#define PWM3DCL                       2003
#define PWM3DC0                       2004
#define PWM3DCL_PWMPW0                2005
#define PWM3DCL_DC0                   2006
#define PWM3DCL_DC                    2007
#define PWM3DC1                       2008
#define PWM3DCL_PWMPW1                2009
#define PWM3DCL_DC1                   2010
#define PWM3DCH                       2011
#define PWM3DC2                       2012
#define PWM3DCH_DC2                   2013
#define PWM3DCH_DC                    2014
#define PWM3DCH_PWMPW2                2015
#define PWM3DC3                       2016
#define PWM3DCH_DC3                   2017
#define PWM3DCH_PWMPW3                2018
#define PWM3DC4                       2019
#define PWM3DCH_DC4                   2020
#define PWM3DCH_PWMPW4                2021
#define PWM3DC5                       2022
#define PWM3DCH_DC5                   2023
#define PWM3DCH_PWMPW5                2024
#define PWM3DC6                       2025
#define PWM3DCH_DC6                   2026
#define PWM3DCH_PWMPW6                2027
#define PWM3DC7                       2028
#define PWM3DCH_DC7                   2029
#define PWM3DCH_PWMPW7                2030
#define PWM3DC8                       2031
#define PWM3DCH_DC8                   2032
#define PWM3DCH_PWMPW8                2033
#define PWM3DC9                       2034
#define PWM3DCH_DC9                   2035
#define PWM3DCH_PWMPW9                2036
#define PWM3CON                       2037
#define PWM3CON_POL                   2038
#define PWM3POL                       2039
#define PWM3CON_OUT                   2040
#define PWM3OUT                       2041
#define PWM3EN                        2042
#define PWM3CON_EN                    2043
#define PWM4DCL                       2044
#define PWM4DCL_PWMPW0                2045
#define PWM4DCL_DC                    2046
#define PWM4DC0                       2047
#define PWM4DCL_DC0                   2048
#define PWM4DCL_PWMPW1                2049
#define PWM4DC1                       2050
#define PWM4DCL_DC1                   2051
#define PWM4DCH                       2052
#define PWM4DCH_PWMPW2                2053
#define PWM4DCH_DC                    2054
#define PWM4DC2                       2055
#define PWM4DCH_DC2                   2056
#define PWM4DCH_PWMPW3                2057
#define PWM4DC3                       2058
#define PWM4DCH_DC3                   2059
#define PWM4DCH_PWMPW4                2060
#define PWM4DC4                       2061
#define PWM4DCH_DC4                   2062
#define PWM4DCH_PWMPW5                2063
#define PWM4DC5                       2064
#define PWM4DCH_DC5                   2065
#define PWM4DCH_PWMPW6                2066
#define PWM4DC6                       2067
#define PWM4DCH_DC6                   2068
#define PWM4DCH_PWMPW7                2069
#define PWM4DC7                       2070
#define PWM4DCH_DC7                   2071
#define PWM4DCH_PWMPW8                2072
#define PWM4DC8                       2073
#define PWM4DCH_DC8                   2074
#define PWM4DCH_PWMPW9                2075
#define PWM4DC9                       2076
#define PWM4DCH_DC9                   2077
#define PWM4CON                       2078
#define PWM4POL                       2079
#define PWM4CON_POL                   2080
#define PWM4CON_OUT                   2081
#define PWM4OUT                       2082
#define PWM4EN                        2083
#define PWM4CON_EN                    2084
#define PWM9DCL                       2085
#define PWM9DC0                       2086
#define PWM9DCL_DC                    2087
#define PWM9DCL_PWMPW0                2088
#define PWM9DCL_DC0                   2089
#define PWM9DC1                       2090
#define PWM9DCL_PWMPW1                2091
#define PWM9DCL_DC1                   2092
#define PWM9DCH                       2093
#define PWM9DCH_PWMPW2                2094
#define PWM9DC2                       2095
#define PWM9DCH_DC                    2096
#define PWM9DCH_DC2                   2097
#define PWM9DCH_PWMPW3                2098
#define PWM9DC3                       2099
#define PWM9DCH_DC3                   2100
#define PWM9DC4                       2101
#define PWM9DCH_PWMPW4                2102
#define PWM9DCH_DC4                   2103
#define PWM9DC5                       2104
#define PWM9DCH_PWMPW5                2105
#define PWM9DCH_DC5                   2106
#define PWM9DC6                       2107
#define PWM9DCH_PWMPW6                2108
#define PWM9DCH_DC6                   2109
#define PWM9DC7                       2110
#define PWM9DCH_PWMPW7                2111
#define PWM9DCH_DC7                   2112
#define PWM9DC8                       2113
#define PWM9DCH_PWMPW8                2114
#define PWM9DCH_DC8                   2115
#define PWM9DC9                       2116
#define PWM9DCH_DC9                   2117
#define PWM9DCH_PWMPW9                2118
#define PWM9CON                       2119
#define PWM9POL                       2120
#define PWM9CON_POL                   2121
#define PWM9OUT                       2122
#define PWM9CON_OUT                   2123
#define PWM9CON_EN                    2124
#define PWM9EN                        2125
#define COG1PHR                       2126
#define G1PHR0                        2127
#define COG1PHR_PHR                   2128
#define COG1PHR_PHR0                  2129
#define G1PHR1                        2130
#define COG1PHR_PHR1                  2131
#define COG1PHR_PHR2                  2132
#define G1PHR2                        2133
#define COG1PHR_PHR3                  2134
#define G1PHR3                        2135
#define G1PHR4                        2136
#define COG1PHR_PHR4                  2137
#define G1PHR5                        2138
#define COG1PHR_PHR5                  2139
#define COG1PHF                       2140
#define G1PHF0                        2141
#define COG1PHF_PHF0                  2142
#define COG1PHF_PHF                   2143
#define G1PHF1                        2144
#define COG1PHF_PHF1                  2145
#define G1PHF2                        2146
#define COG1PHF_PHF2                  2147
#define G1PHF3                        2148
#define COG1PHF_PHF3                  2149
#define G1PHF4                        2150
#define COG1PHF_PHF4                  2151
#define G1PHF5                        2152
#define COG1PHF_PHF5                  2153
#define COG1BLKR                      2154
#define COG1BLKR_BLKR                 2155
#define COG1BLKR_BLKR0                2156
#define G1BLKR0                       2157
#define COG1BLKR_BLKR1                2158
#define G1BLKR1                       2159
#define COG1BLKR_BLKR2                2160
#define G1BLKR2                       2161
#define COG1BLKR_BLKR3                2162
#define G1BLKR3                       2163
#define COG1BLKR_BLKR4                2164
#define G1BLKR4                       2165
#define G1BLKR5                       2166
#define COG1BLKR_BLKR5                2167
#define COG1BLKF                      2168
#define COG1BLKF_BLKF                 2169
#define G1BLKF0                       2170
#define COG1BLKF_BLKF0                2171
#define G1BLKF1                       2172
#define COG1BLKF_BLKF1                2173
#define COG1BLKF_BLKF2                2174
#define G1BLKF2                       2175
#define G1BLKF3                       2176
#define COG1BLKF_BLKF3                2177
#define COG1BLKF_BLKF4                2178
#define G1BLKF4                       2179
#define G1BLKF5                       2180
#define COG1BLKF_BLKF5                2181
#define COG1DBR                       2182
#define G1DBR0                        2183
#define COG1DBR_DBR                   2184
#define COG1DBR_DBR0                  2185
#define G1DBR1                        2186
#define COG1DBR_DBR1                  2187
#define G1DBR2                        2188
#define COG1DBR_DBR2                  2189
#define G1DBR3                        2190
#define COG1DBR_DBR3                  2191
#define G1DBR4                        2192
#define COG1DBR_DBR4                  2193
#define G1DBR5                        2194
#define COG1DBR_DBR5                  2195
#define COG1DBF                       2196
#define COG1DBF_DBF0                  2197
#define G1DBF0                        2198
#define G1DBF                         2199
#define G1DBF1                        2200
#define COG1DBF_DBF1                  2201
#define G1DBF2                        2202
#define COG1DBF_DBF2                  2203
#define G1DBF3                        2204
#define COG1DBF_DBF3                  2205
#define G1DBF4                        2206
